app/controllers/addresses_controller.rb

SELECT * FROM "addresses"
---
  def index
    @county = params[:county] if ['Fayette', 'Jefferson'].include? params[:county]
    @city_center = "38.041968, -84.503795"
    @city_center = @lexington   = "38.041968, -84.503795"  if (@county == 'Fayette')
    @city_center = @louisville  = "38.235483, -85.729065" if (@county == 'Jefferson')
    counter = 300

    page = (params[:page] || 0).to_i*counter
    @order = 'id'
    if params[:sort_by] && Address.column_names.include?(params[:sort_by])

SELECT * FROM "addresses" WHERE ("addresses"."id" = 0)
---
  def show
    @address = Address.find(params[:id])

INSERT INTO "addresses" ("city", "zip", "created_at", "stree_line_2", "updated_at", "street_line_1", "lat", "state", "long") VALUES('lexington', '40509', '2009-09-24 05:30:55', '', '2009-09-24 05:30:55', '645 morgan hills drive', '38.022382', 'ky', '-84.4443')
---
  def create
    @address = Address.new(params[:address])

    respond_to do |format|
      if @address.save

SELECT * FROM "addresses" WHERE ("addresses"."id" = 1)
DELETE FROM "addresses" WHERE "id" = 1
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy