app/controllers/websites_controller.rb

  def fayette_mc
  doc = Nokogiri::HTML(open('http://www.faycom.info/showcase.php?action=list&range=future'))
  @test = Array.new
  doc.search('.style1 > font > font').each do |text|
    unless text.content =~ /^Sale/
      @test << text.content
    end
  end
  @test.each do |street|
    address = Address.new do |a|
      a.street_line_1 = street
      a.city = 'Lexington'
      a.state = 'Ky'
    end
    address.save
---
INSERT INTO "addresses" ("city", "zip", "created_at", "stree_line_2", "updated_at", "street_line_1", "lat", "state", "long") VALUES('Lexington', NULL, '2009-09-24 06:22:31', NULL, '2009-09-24 06:22:31', '3601 FOX FUN ROAD', 37.972443, 'Ky', -84.488779)

  def index
    @websites = Website.all
---
SELECT * FROM "websites"

  def show
    @website = Website.find(params[:id])
---
SELECT * FROM "websites" WHERE ("websites"."id" = 0)